docs/hp15.org
# -*- Mode:Org; Coding:utf-8; fill-column:158 -*-
# ######################################################################################################################################################.H.S.##
# FILE:        readme.org
#+TITLE:       HP Voyager Programs
#+SUBTITLE:    For HP-15C
#+AUTHOR:      Mitch Richling
#+EMAIL:       http://www.mitchr.me/
#+DATE:        2024-02-03
#+DESCRIPTION: Various programs for HP Voyager series calculators
#+KEYWORDS:    Hewlett Packard RPN RPL
#+LANGUAGE:    en
#+OPTIONS:     num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t skip:nil d:nil todo:t pri:nil H:5 p:t author:t html-scripts:nil
#+SEQ_TODO:    TODO:NEW(t)                         TODO:WORK(w)    TODO:HOLD(h)    | TODO:FUTURE(f)   TODO:DONE(d)    TODO:CANCELED(c)
#+PROPERTY: header-args :eval never-export
#+HTML_HEAD: <style>body { width: 95%; margin: 2% auto; font-size: 18px; line-height: 1.4em; font-family: Georgia, serif; color: black; background-color: white; }</style>
# Change max-width to get wider output -- also note #content style below
#+HTML_HEAD: <style>body { min-width: 500px; max-width: 1024px; }</style>
#+HTML_HEAD: <style>h1,h2,h3,h4,h5,h6 { color: #A5573E; line-height: 1em; font-family: Helvetica, sans-serif; }</style>
#+HTML_HEAD: <style>h1,h2,h3 { line-height: 1.4em; }</style>
#+HTML_HEAD: <style>h1.title { font-size: 3em; }</style>
#+HTML_HEAD: <style>.subtitle { font-size: 0.6em; }</style>
#+HTML_HEAD: <style>h4,h5,h6 { font-size: 1em; }</style>
#+HTML_HEAD: <style>.org-src-container { border: 1px solid #ccc; box-shadow: 3px 3px 3px #eee; font-family: Lucida Console, monospace; font-size: 80%; margin: 0px; padding: 0px 0px; position: relative; }</style>
#+HTML_HEAD: <style>.org-src-container>pre { line-height: 1.2em; padding-top: 1.5em; margin: 0.5em; background-color: #404040; color: white; overflow: auto; }</style>
#+HTML_HEAD: <style>.org-src-container>pre:before { display: block; position: absolute; background-color: #b3b3b3; top: 0; right: 0; padding: 0 0.2em 0 0.4em; border-bottom-left-radius: 8px; border: 0; color: white; font-size: 100%; font-family: Helvetica, sans-serif;}</style>
#+HTML_HEAD: <style>pre.example { white-space: pre-wrap; white-space: -moz-pre-wrap; white-space: -o-pre-wrap; font-family: Lucida Console, monospace; font-size: 80%; background: #404040; color: white; display: block; padding: 0em; border: 2px solid black; }</style>
#+HTML_HEAD: <style>blockquote { margin-bottom: 0.5em; padding: 0.5em; background-color: #FFF8DC; border-left: 2px solid #A5573E; border-left-color: rgb(255, 228, 102); display: block; margin-block-start: 1em; margin-block-end: 1em; margin-inline-start: 5em; margin-inline-end: 5em; } </style>
# Change the following to get wider output -- also note body style above
#+HTML_HEAD: <style>#content { max-width: 60em; }</style>
#+HTML_LINK_HOME: https://www.mitchr.me/
#+HTML_LINK_UP: https://richmit.github.io/voyager/
# ######################################################################################################################################################.H.E.##

#+ATTR_HTML: :border 2 solid #ccc :frame hsides :align center
|          <r> | <l>                                 |
|    *Author:* | /{{{author}}}/                      |
|   *Updated:* | /{{{modification-time(%Y-%m-%d)}}}/ |
| *Generated:* | /{{{time(%Y-%m-%d)}}}/              |
#+ATTR_HTML: :align center
Copyright \copy {{{time(%Y)}}} Mitch Richling. All rights reserved.

#+TOC: headlines 5

#+INCLUDE: emacs.org

* Store & Recall Complex Numbers
:PROPERTIES:
:CUSTOM_ID: storclcplx
:END:

The official user guide has a pair of example programs capable of storing and recalling complex values using a matrix for storage.  The programs here are
similar except that they use registrars for storage -- storing the real and complex parts in consecutive storage registers.

With respect to the stack, these programs attempt to behave like the built in =STO= & =RCL= functions:
 - They both preserve the stack contents
 - The =STO CLPX= program leaves the item to be stored in the X stack position

If the calculator is not already in complex mode, then it will be placed in complex mode by the program.

** Usage
:PROPERTIES:
:CUSTOM_ID: storclcplxUsage
:END:

- Inputs:
 - =STO CPLX=: The number to store is on stack level Y, and the first register index is on stack level X.  \\
               The real part of Y is stored at the register indicated by the index in X, and the complex part of Y is stored in the next consecutive register.
 - =RCL CPLX=: The first register index is on stack level X.
- The result stack:
 - =STO CPLX=: The stack is shifted down so the register index is in stack position T.
 - =RCL CPLX=: The register index in stack position X is replaced by the recalled complex number, and the other stack levels are left unchanged.
- Error Conditions
 - Given register is out of bounds: An =Error 3= will be produced & the stack contents will be invalidated.
 - Given register plus one is out of bounds: An =Error 3= will be produced, the stack contents will be invalidated, and the value in the given register will be invalidated.

** Stack Diagrams
:PROPERTIES:
:CUSTOM_ID: storclcplxStk
:END:

#+BEGIN_CENTER
*=STO_CPLX=* -- Store Complex Number
#+END_CENTER
#+ATTR_HTML: :align center :cellpadding 3em
| <c>  | <l>         | <l>         |
|      | *Before*    | *After*     |
| *T:* | t           | Reg Index   |
| *Z:* | z           | t           |
| *Y:* | Cplx Number | z           |
| *X:* | Reg Index   | Cplx Number |

#+BEGIN_CENTER
*=RCL_CPLX=* -- Recall Complex Number
#+END_CENTER
#+ATTR_HTML: :align center :cellpadding 3em
| <c>  | <l>       | <l>         |
|      | *Before*  | *After*     |
| *T:* | t         | t           |
| *Z:* | z         | z           |
| *Y:* | y         | y           |
| *X:* | Reg Index | Cplx Number |

** Resources Used
:PROPERTIES:
:CUSTOM_ID: storclcplxRes
:END:

- Registers Used:
  - Two consecutive registers are used.
  - The first has its index on level X of the stack
- Internal Labels:
  - E RCL_CPLX
  - D STO_CPLX
- External Labels:
  - None

