docs/hp15.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-13 Tue 14:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=1024, initial-scale=1" />
<title>HP Voyager Programs</title>
<meta name="author" content="Mitch Richling" />
<meta name="description" content="Various programs for HP Voyager series calculators" />
<meta name="keywords" content="Hewlett Packard RPN RPL" />
<meta name="generator" content="Org Mode" />

















</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://richmit.github.io/voyager/"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">HP Voyager Programs
<br />
<span class="subtitle">For HP-15C</span>
</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Author:</b></td>
<td class="org-left"><i>Mitch Richling</i></td>
</tr>

<tr>
<td class="org-right"><b>Updated:</b></td>
<td class="org-left"><i>2024-02-13</i></td>
</tr>

<tr>
<td class="org-right"><b>Generated:</b></td>
<td class="org-left"><i>2024-02-13</i></td>
</tr>
</tbody>
</table>
<p align="center">
Copyright &copy; 2024 Mitch Richling. All rights reserved.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#storclcplx">1. Store &amp; Recall Complex Numbers</a>
<ul>
<li><a href="#storclcplxUsage">1.1. Usage</a></li>
<li><a href="#storclcplxStk">1.2. Stack Diagrams</a></li>
<li><a href="#storclcplxRes">1.3. Resources Used</a></li>
<li><a href="#storclcplxCode">1.4. Program Listing</a></li>
</ul>
</li>
<li><a href="#newton">2. Newton's Method for Functions of a Complex Variable</a>
<ul>
<li><a href="#org180a613">2.1. Usage</a></li>
<li><a href="#newtonStk">2.2. Stack Diagrams</a></li>
<li><a href="#newtonRes">2.3. Resources Used</a></li>
<li><a href="#newtonCode">2.4. Program Listing</a></li>
</ul>
</li>
<li><a href="#orgf347260">3. Meta Data</a></li>
</ul>
</div>
</div>

<div id="outline-container-storclcplx" class="outline-2">
<h2 id="storclcplx"><span class="section-number-2">1.</span> Store &amp; Recall Complex Numbers</h2>
<div class="outline-text-2" id="text-storclcplx">
<p>
The official user guide has a pair of example programs capable of storing and recalling complex values using a matrix for storage.  The programs here are
similar except that they use registrars for storage &#x2013; storing the real and complex parts in consecutive storage registers.
</p>

<p>
With respect to the stack, these programs attempt to behave like the built in <code>STO</code> &amp; <code>RCL</code> functions:
</p>
<ul class="org-ul">
<li>They both preserve the stack contents</li>
<li>The <code>STO CLPX</code> program leaves the item to be stored in the X stack position</li>
</ul>

<p>
If the calculator is not already in complex mode, then it will be placed in complex mode by the program.
</p>
</div>

<div id="outline-container-storclcplxUsage" class="outline-3">
<h3 id="storclcplxUsage"><span class="section-number-3">1.1.</span> Usage</h3>
<div class="outline-text-3" id="text-storclcplxUsage">
<ul class="org-ul">
<li>Inputs:
<ul class="org-ul">
<li><code>STO CPLX</code>: The number to store is on stack level Y, and the first register index is on stack level X.  <br />
The real part of Y is stored at the register indicated by the index in X, and the complex part of Y is stored in the next consecutive register.</li>
<li><code>RCL CPLX</code>: The first register index is on stack level X.</li>
</ul></li>
<li>The result stack:
<ul class="org-ul">
<li><code>STO CPLX</code>: The stack is shifted down so the register index is in stack position T.</li>
<li><code>RCL CPLX</code>: The register index in stack position X is replaced by the recalled complex number, and the other stack levels are left unchanged.</li>
</ul></li>
<li>Error Conditions
<ul class="org-ul">
<li>Given register is out of bounds: An <code>Error 3</code> will be produced &amp; the stack contents will be invalidated.</li>
<li>Given register plus one is out of bounds: An <code>Error 3</code> will be produced, the stack contents will be invalidated, and the value in the given register will be invalidated.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-storclcplxStk" class="outline-3">
<h3 id="storclcplxStk"><span class="section-number-3">1.2.</span> Stack Diagrams</h3>
<div class="outline-text-3" id="text-storclcplxStk">
<div class="org-center">
<p>
<b><code>STO_CPLX</code></b> &#x2013; Store Complex Number
</p>
</div>
<table border="2" cellspacing="0" cellpadding="3em" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-center" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-center">&#xa0;</td>
<td class="org-left"><b>Before</b></td>
<td class="org-left"><b>After</b></td>
</tr>

<tr>
<td class="org-center"><b>T:</b></td>
<td class="org-left">t</td>
<td class="org-left">Reg Index</td>
</tr>

<tr>
<td class="org-center"><b>Z:</b></td>
<td class="org-left">z</td>
<td class="org-left">t</td>
</tr>

<tr>
<td class="org-center"><b>Y:</b></td>
<td class="org-left">Cplx Number</td>
<td class="org-left">z</td>
</tr>

<tr>
<td class="org-center"><b>X:</b></td>
<td class="org-left">Reg Index</td>
<td class="org-left">Cplx Number</td>
</tr>
</tbody>
</table>

<div class="org-center">
<p>
<b><code>RCL_CPLX</code></b> &#x2013; Recall Complex Number
</p>
</div>
<table border="2" cellspacing="0" cellpadding="3em" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-center" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-center">&#xa0;</td>
<td class="org-left"><b>Before</b></td>
<td class="org-left"><b>After</b></td>
</tr>

<tr>
<td class="org-center"><b>T:</b></td>
<td class="org-left">t</td>
<td class="org-left">t</td>
</tr>

<tr>
<td class="org-center"><b>Z:</b></td>
<td class="org-left">z</td>
<td class="org-left">z</td>
</tr>

<tr>
<td class="org-center"><b>Y:</b></td>
<td class="org-left">y</td>
<td class="org-left">y</td>
</tr>

<tr>
<td class="org-center"><b>X:</b></td>
<td class="org-left">Reg Index</td>
<td class="org-left">Cplx Number</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-storclcplxRes" class="outline-3">
<h3 id="storclcplxRes"><span class="section-number-3">1.3.</span> Resources Used</h3>
<div class="outline-text-3" id="text-storclcplxRes">
<ul class="org-ul">
<li>Registers Used:
<ul class="org-ul">
<li>Two consecutive registers are used.</li>
<li>The first has its index on level X of the stack</li>
</ul></li>
<li>Internal Labels:
<ul class="org-ul">
<li>E RCL_CPLX</li>
<li>D STO_CPLX</li>
</ul></li>
<li>External Labels:
<ul class="org-ul">
<li>None</li>
</ul></li>
</ul>
</div>
</div>
