docs/hp15.org
* Newton's Method for Functions of a Complex Variable
:PROPERTIES:
:CUSTOM_ID: newton
:END:

Attempts to find a root of a function of a complex variable using Newtons method.  Newton's method is iterative taking an initial guess, and generating
successive guesses that, if we are fortunate, converge to a root.  In what follows, the function is referred to as $f(x)$ and the initial guess is referred to as
$x_0$.  The final guess is referred to as $x_1$.

If the calculator is not already in complex mode, then it will be placed in complex mode by the program.

** Usage

- Running the program
  - Stack Arguments:
    - X best guess for root ($x_0$)
  - Function to solve:
    - Must be =LBL A=
    - When called, $x$ will be on every level of the stack
    - Returns $f(x)$ to stack level Y and $f'(x)$ to stack level X.
- Exit Information
  - Exit Stack State:
    - Z: $f(x_1)$   Function value at $x_1$
    - Y: $|f(x_1)|$ Function magnitude at $x_1$
    - X: $x_1$      Root guess
  - Exit Register State:
    - R8 $\Re(x_1)$
    - R9 $\Im(x_1)$
  - Non-normal Exits:
   - *Program might not converge:*  In this case it will run forever.  If the program is interrupted it is highly likely, but not guaranteed, the last guess will
     be stored in registers 8 & 9.
   - *Evaluation error:* If the function causes an error during evaluation, the program will stop.  The last guess will be stored in R8 & R9.
   - *Zero Derivative:* If the derivative is zero, then an "Error 0" will occur.   The last guess will be stored in R8 & R9.

