docs/hp15.html

<div id="outline-container-storclcplxCode" class="outline-3">
<h3 id="storclcplxCode"><span class="section-number-3">1.4.</span> Program Listing</h3>
<div class="outline-text-3" id="text-storclcplxCode">
<div class="org-center">
<p>
<code>STO_CPLX</code> &#x2013; Store Complex Number
</p>
</div>
<table border="2" cellspacing="0" cellpadding="1em" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-center" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Keystrokes</b> &nbsp;&nbsp;&nbsp;</td>
<td class="org-right"><b>Key Codes</b></td>
<td class="org-right">&nbsp;&nbsp;&nbsp; <b>Stack Contents</b></td>
<td class="org-center">&nbsp;&nbsp;&nbsp;</td>
<td class="org-left"><b>Comments</b></td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>f</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>LBL</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>D</span></td>
<td class="org-right"><code>42,21,14</code></td>
<td class="org-right">x y z t</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>STO</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>I</span></td>
<td class="org-right"><code>44 25</code></td>
<td class="org-right">x y z t</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>R↓</span></td>
<td class="org-right"><code>33</code></td>
<td class="org-right">y z t x</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>STO</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>(i)</span></td>
<td class="org-right"><code>44 24</code></td>
<td class="org-right">y z t x</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>f</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>ISG</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>I</span></td>
<td class="org-right"><code>42, 6,25</code></td>
<td class="org-right">y z t x</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>g</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>CLX</span></td>
<td class="org-right"><code>43 35</code></td>
<td class="org-right">y z t x</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">NOP</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>f</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>Re≷Im</span></td>
<td class="org-right"><code>42 30</code></td>
<td class="org-right">~y z t x</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>STO</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>(i)</span></td>
<td class="org-right"><code>44 24</code></td>
<td class="org-right">~y z t x</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>f</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>Re≷Im</span></td>
<td class="org-right"><code>42 30</code></td>
<td class="org-right">y z t x</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">Ret</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>g</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>RTN</span></td>
<td class="org-right"><code>43 32</code></td>
<td class="org-right">&#xa0;</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<div class="org-center">
<p>
<code>RCL_CPLX</code> &#x2013; Recall Complex Number
</p>
</div>
<table border="2" cellspacing="0" cellpadding="1em" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-center" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Keystrokes</b> &nbsp;&nbsp;&nbsp;</td>
<td class="org-right"><b>Key Codes</b></td>
<td class="org-right">&nbsp;&nbsp;&nbsp; <b>Stack Contents</b></td>
<td class="org-center">&nbsp;&nbsp;&nbsp;</td>
<td class="org-left"><b>Comments</b></td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>f</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>LBL</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>E</span></td>
<td class="org-right"><code>42,21,15</code></td>
<td class="org-right">x y z t</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>STO</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>I</span></td>
<td class="org-right"><code>44 25</code></td>
<td class="org-right">x y z t</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>R↓</span></td>
<td class="org-right"><code>33</code></td>
<td class="org-right">y z t x</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>RCL</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>(i)</span></td>
<td class="org-right"><code>45 24</code></td>
<td class="org-right">Cr y z t</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>f</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>ISG</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>I</span></td>
<td class="org-right"><code>42,6,25</code></td>
<td class="org-right">Cr y z t</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>g</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>CLX</span></td>
<td class="org-right"><code>43 35</code></td>
<td class="org-right">Cr y z t</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">NOP</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>f</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>Re≷Im</span></td>
<td class="org-right"><code>42 30</code></td>
<td class="org-right">~Cr y z t</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>g</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>CLX</span></td>
<td class="org-right"><code>43 35</code></td>
<td class="org-right">~Cr y z t</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">Disable stack</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>RCL</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>(i)</span></td>
<td class="org-right"><code>45 24</code></td>
<td class="org-right">~C y z t</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>f</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>Re≷Im</span></td>
<td class="org-right"><code>42 30</code></td>
<td class="org-right">C y z t</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">Ret</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>g</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>RTN</span></td>
<td class="org-right"><code>43 32</code></td>
<td class="org-right">&#xa0;</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-newton" class="outline-2">
<h2 id="newton"><span class="section-number-2">2.</span> Newton's Method for Functions of a Complex Variable</h2>
<div class="outline-text-2" id="text-newton">
<p>
Attempts to find a root of a function of a complex variable using Newtons method.  Newton's method is iterative taking an initial guess, and generating
successive guesses that, if we are fortunate, converge to a root.  In what follows, the function is referred to as \(f(x)\) and the initial guess is referred to as
\(x_0\).  The final guess is referred to as \(x_1\).
</p>

<p>
If the calculator is not already in complex mode, then it will be placed in complex mode by the program.
</p>
</div>

<div id="outline-container-org180a613" class="outline-3">
<h3 id="org180a613"><span class="section-number-3">2.1.</span> Usage</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Running the program
<ul class="org-ul">
<li>Stack Arguments:
<ul class="org-ul">
<li>X best guess for root (\(x_0\))</li>
</ul></li>
<li>Function to solve:
<ul class="org-ul">
<li>Must be <code>LBL A</code></li>
<li>When called, \(x\) will be on every level of the stack</li>
<li>Returns \(f(x)\) to stack level Y and \(f'(x)\) to stack level X.</li>
</ul></li>
</ul></li>
<li>Exit Information
<ul class="org-ul">
<li>Exit Stack State:
<ul class="org-ul">
<li>Z: \(f(x_1)\)   Function value at \(x_1\)</li>
<li>Y: \(|f(x_1)|\) Function magnitude at \(x_1\)</li>
<li>X: \(x_1\)      Root guess</li>
</ul></li>
<li>Exit Register State:
<ul class="org-ul">
<li>R8 \(\Re(x_1)\)</li>
<li>R9 \(\Im(x_1)\)</li>
</ul></li>
<li>Non-normal Exits:
<ul class="org-ul">
<li><b>Program might not converge:</b>  In this case it will run forever.  If the program is interrupted it is highly likely, but not guaranteed, the last guess will
be stored in registers 8 &amp; 9.</li>
<li><b>Evaluation error:</b> If the function causes an error during evaluation, the program will stop.  The last guess will be stored in R8 &amp; R9.</li>
<li><b>Zero Derivative:</b> If the derivative is zero, then an "Error 0" will occur.   The last guess will be stored in R8 &amp; R9.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
