docs/hp15.org
** Stack Diagrams
:PROPERTIES:
:CUSTOM_ID: newtonStk
:END:

#+BEGIN_CENTER
=NEWTON= -- Newton's Method for a Function of a Complex Variable
#+END_CENTER
#+ATTR_HTML: :align center :cellpadding 3em
| <c>  | <l>      | <l>                 |
|      | *Before* | *After*             |
| *T:* | t        | ?                   |
| *Z:* | z        | $f(x_1)$            |
| *Y:* | y        | $\vert f(x_1)\vert$ |
| *X:* | x0       | $x_1$               |

** Resources Used
:PROPERTIES:
:CUSTOM_ID: newtonRes
:END:

- Registers Used:
  - R8 Real component of root guess
  - R9 Complex component of root guess
- Internal Labels:
  - D Program label
  - 1 Main loop target
- External Labels:
  - A function to solve
  - E RCL_CPLX
  - D STO_CPLX

