docs/hp15.html

<div id="outline-container-newtonStk" class="outline-3">
<h3 id="newtonStk"><span class="section-number-3">2.2.</span> Stack Diagrams</h3>
<div class="outline-text-3" id="text-newtonStk">
<div class="org-center">
<p>
<code>NEWTON</code> &#x2013; Newton's Method for a Function of a Complex Variable
</p>
</div>
<table border="2" cellspacing="0" cellpadding="3em" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-center" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-center">&#xa0;</td>
<td class="org-left"><b>Before</b></td>
<td class="org-left"><b>After</b></td>
</tr>

<tr>
<td class="org-center"><b>T:</b></td>
<td class="org-left">t</td>
<td class="org-left">?</td>
</tr>

<tr>
<td class="org-center"><b>Z:</b></td>
<td class="org-left">z</td>
<td class="org-left">\(f(x_1)\)</td>
</tr>

<tr>
<td class="org-center"><b>Y:</b></td>
<td class="org-left">y</td>
<td class="org-left">\(\vert f(x_1)\vert\)</td>
</tr>

<tr>
<td class="org-center"><b>X:</b></td>
<td class="org-left">x0</td>
<td class="org-left">\(x_1\)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-newtonRes" class="outline-3">
<h3 id="newtonRes"><span class="section-number-3">2.3.</span> Resources Used</h3>
<div class="outline-text-3" id="text-newtonRes">
<ul class="org-ul">
<li>Registers Used:
<ul class="org-ul">
<li>R8 Real component of root guess</li>
<li>R9 Complex component of root guess</li>
</ul></li>
<li>Internal Labels:
<ul class="org-ul">
<li>D Program label</li>
<li>1 Main loop target</li>
</ul></li>
<li>External Labels:
<ul class="org-ul">
<li>A function to solve</li>
<li>E RCL_CPLX</li>
<li>D STO_CPLX</li>
</ul></li>
</ul>
</div>
</div>
