docs/hp15.org
** Program Listing
:PROPERTIES:
:CUSTOM_ID: newtonCode
:END:

#+BEGIN_CENTER
=NEWTON= -- Newton's Method for a Function of a Complex Variable
#+END_CENTER
#+ATTR_HTML: :align center :cellpadding 1em
| <l>                    |         <r> |                        <r> |    <c>    | <l>                 |
| *Keystrokes* {{{SPC}}} | *Key Codes* | {{{SPC}}} *Stack Contents* | {{{SPC}}} | *Comments*          |
| {{{c15(  f LBL C  )}}} |  =42,21,13= |                   x0 ? ? ? |           |                     |
| {{{c15(  8        )}}} |         =8= |                   8 x0 ? ? |           |                     |
| {{{c15(  GSB D    )}}} |     =32 14= |                   x0 ? ? 8 |           | STO_CPLX            |
| {{{c15(  f LBL 1  )}}} |  =42,21, 1= |                    ? ? ? ? |           |                     |
| {{{c15(  8        )}}} |         =8= |                    8 ? ? ? |           |                     |
| {{{c15(  GSB E    )}}} |     =32 15= |                   x0 ? ? ? |           | RCL_CPLX            |
| {{{c15(  ENTER    )}}} |        =36= |                  x0 x0 ? ? |           | x0=Previous iterate |
| {{{c15(  ENTER    )}}} |        =36= |                 x0 x0 x0 ? |           |                     |
| {{{c15(  ENTER    )}}} |        =36= |                x0 x0 x0 x0 |           |                     |
| {{{c15(  GSB A    )}}} |     =32 11= |                   df f ? ? |           | Function to solve   |
| {{{c15(  x≷y      )}}} |        =34= |                   f df ? ? |           | f=f(x0), df=f'(x0)  |
| {{{c15(  ENTER    )}}} |        =36= |                   f f df ? |           |                     |
| {{{c15(  ENTER    )}}} |        =36= |                   f f f df |           |                     |
| {{{c15(  8        )}}} |         =8= |                   8 f f df |           |                     |
| {{{c15(  GSB E    )}}} |     =32 15= |                  x0 f f df |           | RCL_CPLX            |
| {{{c15(  g R↑     )}}} |     =43 33= |                  df x0 f f |           |                     |
| {{{c15(  g R↑     )}}} |     =43 33= |                  f df x0 f |           |                     |
| {{{c15(  x≷y      )}}} |        =34= |                  df f x0 f |           |                     |
| {{{c15(  ÷        )}}} |        =10= |                f÷df x0 f f |           |                     |
| {{{c15(  x≷y      )}}} |        =34= |                x0 f÷df f f |           |                     |
| {{{c15(  ENTER    )}}} |        =36= |               x0 x0 f÷df f |           |                     |
| {{{c15(  R↓       )}}} |        =33= |               x0 f÷df f x0 |           |                     |
| {{{c15(  x≷y      )}}} |        =34= |               f÷df x0 f x0 |           |                     |
| {{{c15(  -        )}}} |        =30= |                 x1 f x0 x0 |           | x1=Current iterate  |
| {{{c15(  8        )}}} |         =8= |                  8 x1 f x0 |           |                     |
| {{{c15(  GSB D    )}}} |     =32 14= |                  x1 f x0 8 |           | STO_CPLX            |
| {{{c15(  x≷y      )}}} |        =34= |                  f x1 x0 8 |           |                     |
| {{{c15(  ENTER    )}}} |        =36= |                 f f  x1 x0 |           |                     |
| {{{c15(  g ABS    )}}} |     =43 16= |                 fM f x1 x0 |           | fM=abs(f(x1))       |
| {{{c15(  1        )}}} |         =1= |                  1 fM f x1 |           |                     |
| {{{c15(  EEX      )}}} |        =26= |                  1 fM f x1 |           |                     |
| {{{c15(  7        )}}} |         =7= |                1e7 fM f x1 |           |                     |
| {{{c15(  CHS      )}}} |        =16= |                  e fM f x1 |           | e=Epsilon           |
| {{{c15(  g TEST 8 )}}} |  =43,30, 8= |                  e fM f x1 |           | y>x?                |
| {{{c15(  GTO 1    )}}} |      =22 1= |                  e fM f x1 |           |                     |
| {{{c15(  g R↑     )}}} |     =43 33= |                  x1 e fM f |           |                     |
| {{{c15(  x≷y      )}}} |        =34= |                  e x1 fM f |           |                     |
| {{{c15(  R↓       )}}} |        =33= |                  x1 fM f e |           |                     |
| {{{c15(  g RTN    )}}} |     =43 32= |                  x1 fM f e |           |                     |


