docs/hp15.html

<div id="outline-container-newtonCode" class="outline-3">
<h3 id="newtonCode"><span class="section-number-3">2.4.</span> Program Listing</h3>
<div class="outline-text-3" id="text-newtonCode">
<div class="org-center">
<p>
<code>NEWTON</code> &#x2013; Newton's Method for a Function of a Complex Variable
</p>
</div>
<table border="2" cellspacing="0" cellpadding="1em" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-center" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Keystrokes</b> &nbsp;&nbsp;&nbsp;</td>
<td class="org-right"><b>Key Codes</b></td>
<td class="org-right">&nbsp;&nbsp;&nbsp; <b>Stack Contents</b></td>
<td class="org-center">&nbsp;&nbsp;&nbsp;</td>
<td class="org-left"><b>Comments</b></td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>f</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>LBL</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>C</span></td>
<td class="org-right"><code>42,21,13</code></td>
<td class="org-right">x0 ? ? ?</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>8</span></td>
<td class="org-right"><code>8</code></td>
<td class="org-right">8 x0 ? ?</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>GSB</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>D</span></td>
<td class="org-right"><code>32 14</code></td>
<td class="org-right">x0 ? ? 8</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">STO_CPLX</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>f</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>LBL</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>1</span></td>
<td class="org-right"><code>42,21, 1</code></td>
<td class="org-right">? ? ? ?</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>8</span></td>
<td class="org-right"><code>8</code></td>
<td class="org-right">8 ? ? ?</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>GSB</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>E</span></td>
<td class="org-right"><code>32 15</code></td>
<td class="org-right">x0 ? ? ?</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">RCL_CPLX</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>ENTER</span></td>
<td class="org-right"><code>36</code></td>
<td class="org-right">x0 x0 ? ?</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">x0=Previous iterate</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>ENTER</span></td>
<td class="org-right"><code>36</code></td>
<td class="org-right">x0 x0 x0 ?</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>ENTER</span></td>
<td class="org-right"><code>36</code></td>
<td class="org-right">x0 x0 x0 x0</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>GSB</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>A</span></td>
<td class="org-right"><code>32 11</code></td>
<td class="org-right">df f ? ?</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">Function to solve</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>x≷y</span></td>
<td class="org-right"><code>34</code></td>
<td class="org-right">f df ? ?</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">f=f(x0), df=f'(x0)</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>ENTER</span></td>
<td class="org-right"><code>36</code></td>
<td class="org-right">f f df ?</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>ENTER</span></td>
<td class="org-right"><code>36</code></td>
<td class="org-right">f f f df</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>8</span></td>
<td class="org-right"><code>8</code></td>
<td class="org-right">8 f f df</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>GSB</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>E</span></td>
<td class="org-right"><code>32 15</code></td>
<td class="org-right">x0 f f df</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">RCL_CPLX</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>g</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>R↑</span></td>
<td class="org-right"><code>43 33</code></td>
<td class="org-right">df x0 f f</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>g</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>R↑</span></td>
<td class="org-right"><code>43 33</code></td>
<td class="org-right">f df x0 f</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>x≷y</span></td>
<td class="org-right"><code>34</code></td>
<td class="org-right">df f x0 f</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>÷</span></td>
<td class="org-right"><code>10</code></td>
<td class="org-right">f÷df x0 f f</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>x≷y</span></td>
<td class="org-right"><code>34</code></td>
<td class="org-right">x0 f÷df f f</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>ENTER</span></td>
<td class="org-right"><code>36</code></td>
<td class="org-right">x0 x0 f÷df f</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>R↓</span></td>
<td class="org-right"><code>33</code></td>
<td class="org-right">x0 f÷df f x0</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>x≷y</span></td>
<td class="org-right"><code>34</code></td>
<td class="org-right">f÷df x0 f x0</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>-</span></td>
<td class="org-right"><code>30</code></td>
<td class="org-right">x1 f x0 x0</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">x1=Current iterate</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>8</span></td>
<td class="org-right"><code>8</code></td>
<td class="org-right">8 x1 f x0</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>GSB</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:yellow;background-color:#644117;border-radius:0.3em;'>D</span></td>
<td class="org-right"><code>32 14</code></td>
<td class="org-right">x1 f x0 8</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">STO_CPLX</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>x≷y</span></td>
<td class="org-right"><code>34</code></td>
<td class="org-right">f x1 x0 8</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>ENTER</span></td>
<td class="org-right"><code>36</code></td>
<td class="org-right">f f  x1 x0</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>g</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>ABS</span></td>
<td class="org-right"><code>43 16</code></td>
<td class="org-right">fM f x1 x0</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">fM=abs(f(x1))</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>1</span></td>
<td class="org-right"><code>1</code></td>
<td class="org-right">1 fM f x1</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>EEX</span></td>
<td class="org-right"><code>26</code></td>
<td class="org-right">1 fM f x1</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>7</span></td>
<td class="org-right"><code>7</code></td>
<td class="org-right">1e7 fM f x1</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>CHS</span></td>
<td class="org-right"><code>16</code></td>
<td class="org-right">e fM f x1</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">e=Epsilon</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>g</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>TEST</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>8</span></td>
<td class="org-right"><code>43,30, 8</code></td>
<td class="org-right">e fM f x1</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">y&gt;x?</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>GTO</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>1</span></td>
<td class="org-right"><code>22 1</code></td>
<td class="org-right">e fM f x1</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>g</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>R↑</span></td>
<td class="org-right"><code>43 33</code></td>
<td class="org-right">x1 e fM f</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>x≷y</span></td>
<td class="org-right"><code>34</code></td>
<td class="org-right">e x1 fM f</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:white;background-color:#644117;border-radius:0.3em;'>R↓</span></td>
<td class="org-right"><code>33</code></td>
<td class="org-right">x1 fM f e</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>g</span> <span style='font-family:sans-serif;margin:0;padding:.1em .4em .1em .4em;color:cyan;background-color:#644117;border-radius:0.3em;'>RTN</span></td>
<td class="org-right"><code>43 32</code></td>
<td class="org-right">x1 fM f e</td>
<td class="org-center">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
